
{
  "title":"Alternative Approaches to Molecular Biology",
  "content":"« Previous | Next »\nSession Overview In this session some variations to the standard mechanisms of DNA replication, transcription and translation are discussed. The minor differences in DNA replication, transcription and translation in eukaryotes, prokaryotes, and viruses are discussed as a way to more fully understand the important processes involved in the copying and expression of genomes.\nLearning Objectives\nTo understand how DNA replication is different for singled-stranded circular, double-stranded circular and double-stranded linear chromosomes. To understand how replication of large DNA genomes, small DNA genomes, and RNA genomes differs. To understand how transcription is different for prokaryotes and eukaryotes, with an emphasis on splicing in eukaryotes. To understand how translation is different for prokaryotes and eukaryotes, with an emphasis on polycistronic messages in prokaryotes. To understand how a virus can encode the needed proteins in a compact genome. Session Activities Lecture Video Watch the lecture video excerpt\nAlternative Approaches to Molecular Biology Check Yourself Question 1 Shown below is the genomic structure of the human β-globin gene. The numbers within the boxes indicate the length (in nucleotides) of each region. The DNA sequences corresponding to the start codon and the stop codon are indicated. Which regions are present in the initial transcript? both check exons close introns close Check \u0026emsp; Show Solution Both introns and exons are present in the initial transcript. Question 2 What is the length (in nucleotides) of the mature, processed β-globin mRNA? 1600 close 438 close 620 check 980 close Check Question 3 The following is the sequence of a double stranded DNA molecule: 5’ ATCATGACACTATGCAAGCCGAGAAGCAACAATAGCGAAGCCCATTAA 3’ 3’ TAGTATTGTGATACGTTCGGCTCTTCGTTGTTATCGCTTCGGGTAATT 5’ This DNA can encode… 3 polypeptides: one with 7 amino acids, one with 11, and one with 14 check a polypeptide of 11 amino acids close a polypeptide of 12 amino acids close a polypeptide of 14 amino acids close a polypeptide of 15 amino acids close a polypeptide of 7 amino acids close a polypeptide of 8 amino acids close a polypeptide of 8 amino acids and another with 12 close Check Session Activities Practice Problems Problems (PDF) Solutions (PDF) Further Study Useful Links Telomere Replication Elizabeth Blackburn Part 1: The Roles of Telomeres and Telomerase RNA Splicing—Removing Introns after RNA Transcription RNA Splicing—An Introduction HIV / AIDS Replication Animation Video « Previous | Next »\n"}


