
{
  "title":"Molecular Biology",
  "content":"« Previous | Next »\nA diagram showing translation of a mRNA and synthesis of a protein by a ribosome. (Wikimedia Commons, by LadyofHats).\nThis unit will introduce some classic experiments in Molecular Biology, which led to the discovery of DNA as the hereditary material, the structure of DNA, and the semi-conservative model of DNA replication. We will cover DNA replication, and how the cell uses its DNA instructions to make an RNA message, and an RNA message to make a protein. Some variations to the standard mechanisms of DNA replication, transcription and translation will also be discussed. Finally, we will cover some of the general principles of gene regulation.\nDuring this unit, you will become familiar with the experiments of Griffith, Avery, Hershey and Chase, Chargaff, Watson, Crick, and Franklin, and Meselson and Stahl. You will be able to draw a schematic of DNA, recognize the 5\u0026rsquo; and 3\u0026rsquo; ends of DNA, and predict the direction in which replication will proceed. You will be able to predict the mRNA produced and the resulting protein made from a given DNA sequence. In addition, you will analyze the effects of a DNA mutation on the RNA and protein produced from that DNA. You will compare the differences in DNA replication between singled-stranded circular, double-stranded circular and double-stranded linear chromosomes.\nBy the end of this unit, you will understand the semi-conservative model of DNA replication and be able to outline the processes and basic components of transcription and translation. You will know how replication of large DNA genomes, small DNA genomes, and RNA genomes differs, and explore how transcription and translation differ among prokaryotes, eukaryotes, and viruses.\nFinally, you will understand the different mechanisms working together to regulate the Lac operon, distinguish positive and negative regulatory mechanisms, predict the phenotype caused by different mutations within the components and regulatory features of the Lac operon, and understand the benefit to an organism of regulating genes.\nLooking for something specific in this course? The Resource Index compiles links to most course resources in a single page.\n« Previous | Next »\n"}


