
{
  "title":"Syllabus",
  "content":"« Previous | Next »\nCourse Overview This course focuses on the basic principles of biochemistry, genetics, molecular biology, and recombinant DNA technologies. The material presented introduces modern biology at the molecular level: the structure and function of biological macromolecules, the basics of cellular metabolism, meiosis and inheritance, DNA replication, the basics of gene expression, and general recombinant DNA techniques.\nPrerequisites There are no formal prerequisites for this course. At MIT, it is usually taken during the freshman (first) year.\nPrior to taking this course, you may want to review Pre-7.01 Getting up to Speed in Biology, a self-paced course designed to help prepare students for their first college-level biology class.\nCourse Goals After completing the four units of this course, you should be able to:\nIdentify the general structure and function of carbohydrates, phospholipds, proteins, enzymes and nucleic acids. Outline the general processes used by the cell to generate cellular energy from sugar and to generate the energy and reducing agent needed for the Calvin cycle. Describe how DNA was shown to be the genetic material and how DNA is copied. Describe the structure and regulation of genes, and the structure and synthesis of proteins. Understand the inheritance of two or more traits based upon Mendelian genetics. Apply this knowledge to drawing and decoding human pedigrees. Understand the inheritance of traits when the genes involved are linked. Predict the results of genetic crosses involving two or more traits when the genes involved are linked or unlinked. Understand the general tools and reagents used in recombinant DNA technologies. Outline a general strategy for making a recombinant DNA library, screening a recombinant DNA library, and analyzing the DNA fragment identified. Design a general strategy for identifying a gene of interest using recombinant DNA techniques. Format Fundamentals of Biology was designed specifically for independent study. It draws upon material developed for the three versions of MIT\u0026rsquo;s Introductory Biology classes known as 7.012, 7.013, and 7.014. All three classes cover the same core material, which includes the fundamental principles of biochemistry, genetics, molecular biology, and cell biology. In addition, each version of the subject has its own distinctive material.\n7.012, with Professors Eric Lander and Robert Weinberg, focuses on genomics, neurobiology, and cancer cell biology. 7.013, with Professors Hazel Sive and Tyler Jacks, focuses on development and cancer cell biology. 7.014, with Professors Graham Walker and Penny Chisholm, focuses on ecology and environment. The content of this Fundamentals of Biology OCW Scholar course is organized into four major units:\nBiochemistry Molecular Biology Genetics Recombinant DNA Each unit has been further divided into a sequence of sessions that cover an amount you might expect to complete in one sitting. Most sessions include:\nOne or more lecture video excerpts by MIT faculty explaining a key concept in biology. Problems (with solutions) and interactive concept quizzes. Brief help session videos by experienced MIT Teaching Assistants. Lists of important terms and definitions. Suggested topics and links for further study. The following textbook was used when this course was taught on the MIT campus:\nCampbell, N. A., J.B. Reece, et al. Biology. 8th ed. Pearson Benjamin Cummings, 2008. ISBN: 9780805368444.\nOCW users will find equal value in most standard introductory biology textbooks. Throughout the course, we suggest topics of study that can be found in any standard textbook.\nMIT expects its students to spend about 150 hours on this course. More than half of that time is spent preparing for class and doing assignments. It\u0026rsquo;s difficult to estimate how long it will take you to complete the course, but you can probably expect to spend an hour or more working through each individual session.\nMeet the Team This OCW Scholar course was developed by the following MIT Faculty and Teaching Staff:\nProf. Eric Lander Prof. Robert Weinberg Prof. Tyler Jacks Prof. Hazel Sive Prof. Graham Walker Prof. Penny Chisholm Dr. Michelle Mischke To learn more about the Faculty and Teaching Staff, visit the Meet the Instructors page.\nThe Help Session Videos were developed by the following MIT Teaching Assistants:\nJoseph Robert Dorkin Sera Thornton Genevieve Michelle Gould Nicole De Nisco To learn more about the Teaching Assistants, visit the Meet the TAs page.\n« Previous | Next »\n"}


