
{
  "title":"Pedigrees",
  "content":"« Previous | Next »\nSession Overview Genetics in humans cannot be studied by performing controlled crosses rather, analysis of inheritance patterns in an existing population must be used. An approach, called pedigree analysis, is used to study the inheritance of genes in humans. This session will outline how to construct a family pedigree, and how to interpret the information in a pedigree using Mendel\u0026rsquo;s laws of inheritance and an understanding of the chromosome theory of inheritance.\nLearning Objectives\nTo construct a pedigree based on a family history. To analyze the information in a pedigree by applying the laws of inheritance. To determine the mode of inheritance of a trait based upon the information in a pedigree. To predict the probability a child of particular parents would inherit the trait in question. Session Activities Lecture Video For this session, watch the video lecture called \u0026ldquo;Human Genetics\u0026rdquo; by Prof. Eric Lander recorded in 2004, starting partway into the lecture until the end.\nHuman Genetics Check Yourself Question 1 The following pedigree represents the inheritance pattern of a specific genetic trait in humans. Assume the trait is common in the population. ![gensession3_quizzes.gif](../../static_resources/2550e3b6eb2d7737c03c6626fa4c3352_gensession3_quizzes.gif) This disorder could be inherited in which of the following ways? as an Autosomal Dominant trait close as an Autosomal Recessive trait close as an X-linked Dominant trait close as an X-linked recessive trait close as both an Autosomal Dominant trait and an X-linked Dominant trait close as both an Autosomal Recessive trait and an X-linked recessive trait check Check Session Activities Help Session Video Watch the short video of Genny Gould explaining how to analyze a human pedigree (Question 2 in the practice problems below).\nPedigrees Practice Problems Problems (PDF) Solutions (PDF) Further Study Suggested topics for further study in an introductory-level Biology textbook Constructing a family pedigree Pedigree analysis Chromosome theory of inheritance Useful Links Pedigree Analysis, Example 1 Pedigree Analysis, Example 2 Pedigree Analysis, Example 3 « Previous | Next »\n"}


