
{
  "title":"Basic Mechanics of Cloning: Restriction Enzymes \u0026 Cloning Vectors",
  "content":"« Previous | Next »\nSession Overview This session will cover 1) what restriction enzymes are and how they cut DNA, 2) the different types of restriction enzymes and the advantages and disadvantages of using them, and 3) how restriction enzymes are used to create a recombinant DNA molecule.\nLearning Objectives\nTo understand what a restriction endonuclease (restriction enzyme) is and how it functions. To identify restriction enzyme(s) recognition sites given a section of DNA. To understand the difference between enzymes that cut double-stranded DNA to produce a region of single-stranded DNA and those that do not, and the appropriate use of each type of enzyme. To determine which restriction enzyme to use to create a desired piece of recombinant DNA. To know the function of DNA ligase. To understand what a vector is, what the minimum requirements are, and how it is used. Session Activities Lecture Video Watch the lecture video excerpt\nBasic Mechanisms of Cloning, Excerpt 1 Check Yourself Question 1 Select the true statement or statements. 1. Restriction enzymes break a phosphodiester bond on only one of the two DNA strands. 2. Restriction enzymes break a phosphodiester bond on both of the DNA strands. 3. All restriction enzymes produce a region of single-stranded DNA. 4. Two different linear DNA molecules are cut with a single restriction enzyme such that only one end of each molecule is cut and these ends have regions of single stranded DNA. The two different DNA molecules will have compatible ends. 5. Two different linear DNA molecules are each cut with a different restriction enzyme such that only one end of each molecule is cut and these ends have regions of single stranded DNA. The two different DNA molecules will NOT have compatible ends. a,c close a,d close b,d check c,e close Check Session Activities Lecture Video Watch the lecture video excerpt\nBasic Mechanisms of Cloning, Excerpt 2 Check Yourself Question 1 Which of the following features are essential in a vector that will be used to make many copies of the human gene X in bacterial cells? 1. A restriction enzyme site 2. A human origin of replication 3. A bacterial origin of replication 4. A bacterial selectable marker a,b,c close a,b,d close a,c,d check b,d close c,d close Check Session Activities Lecture Video Watch the lecture video excerpt\nBasic Mechanisms of Cloning, Excerpt 3 Check Yourself You want to:\nObtain the human insulin gene. Cut chosen vector and ligate the human insulin gene into vector. Use this ligation mixture to transform E. coli cells. Transfer E. coli cells to growth media. Select for E. coli cells that have obtained any vector. Each of the steps listed above requires a specific DNA sequence found on the vector.\nQuestion 1 In the steps above, where is the restriction enzyme recognition site first needed? Step 1 close Step 2 check Step 3 close Step 4 close Step 5 close Check Question 2 In the steps above, where is the ampicillin resistance gene first needed? Step 1 close Step 2 close Step 3 close Step 4 close Step 5 check Check Question 3 In the steps above, where is the bacterial origin of replication first needed? Step 1 close Step 2 close Step 3 close Step 4 check Step 5 close Check Session Activities Practice Problems Problems (PDF) Solutions (PDF) Further Study Suggested topics for further study in an introductory-level Biology textbook Steps involved in a basic cloning strategy Useful Links Cloning in a Plasmid Vector Key Steps of Molecular Cloning « Previous | Next »\n"}


