
{
  "title":"DNA Replication",
  "content":"« Previous | Next »\nSession Overview This session will explain how DNA is replicated prior to cell division. In this process, DNA polymerase uses an original strand as a template to create a new daughter strand of DNA. Polymerization occurs in the 5\u0026rsquo; to 3\u0026rsquo; direction, creating a new strand that is anti-parallel to the original. Polymerization begins at a specific DNA sequence called the Origin of Replication and proceeds in two directions along both template strands. Because of the directionality of synthesis, one strand is synthesized continuously, while the other strand is synthesized in small fragments, which are then joined together by DNA ligase.\nLearning Objectives\nTo understand the semi-conservative model of DNA replication. To recognize the 5\u0026rsquo; and 3\u0026rsquo; ends of DNA and predict the direction in which replication will proceed. To predict the sequence of a newly synthesized strand of DNA, based on the sequence of the original strand. To identify the leading and lagging strands during replication. To understand the function of helicase and DNA ligase and explain why they are necessary. Session Activities Lecture Video Watch the lecture video excerpt\nDNA Replication Check Yourself Below is a representation of an origin of replication and the two associated replication forks. Synthesis of new DNA occurs on both strands.\nQuestion 1 At Fork 1, which template strand (1 or 2) is copied in a continuous manner? Template strand 1 check Template strand 2 close Check Question 2 To which site or sites can the primer 5'-CAAGG-3' bind to initiate replication? All Sites close Only Site A close Only Site B close Only Site C close Only Site D close Sites A and B close Sites B and D check Check Session Activities Help Session Video Watch the short video of Sera Thornton explaining the numbering and labeling conventions of RNA and of proteins.\nExplanation of 5\u0026rsquo; and 3\u0026rsquo;, C terminus, and N terminus Practice Problems Problems (PDF) Solutions (PDF) Further Study Suggested topics for further study in an introductory-level Biology textbook DNA Replication Useful Links Replication: Mechanism of Replication (Basic), 3-D Animation Library Replication: Mechanism of Replication (Advanced), 3-D Animation Library « Previous | Next »\n"}


