
{
  "title":"Biochemistry",
  "content":"« Previous | Next »\nAn illustration showing the biochemical structures present in a T Cell Receptor (image by Michelle Mischke).\nThis unit will introduce the course and cover the basics of biochemistry and cell composition. First, we will introduce the levels of organization of life, and the different types of organisms. We will then cover the structure of biological molecules and the molecular forces involved in the formation of these molecules. We will learn about the general structure and function of lipids, carbohydrates, and nucleic acids, as well as the composition, structure, and function of proteins. After learning about the major groups of macromolecules, we will explore their interactions within a cell, starting with metabolism, Gibbs free energy, biochemical reactions, enzymes and ATP as the energy currency. We will outline the cellular mechanisms for harvesting energy from glucose and related sugars, briefly outline glycolysis as a mechanism to generate ATP, and discuss the fate of the pyruvate produced in glycolysis under anaerobic and aerobic conditions. Finally, we will cover the general ideas of both cyclic and non-cyclic photophosphorylation and how these two processes are used by cells to generate the ATP and the NADPH needed for the Calvin Cycle in photosynthesis.\nDuring this unit, you will describe both the chemical and molecular composition of a cell, and define the basic components of biological macromolecules. You will identify the forces that act in biological systems: covalent bonds, ionic bonds, hydrogen bonds, van der Waal\u0026rsquo;s forces, and hydrophobicity. You will draw a generic amino acid and categorize each of the 20 amino acids appropriately based upon the nature of the side chain. You will also apply the general laws of thermodynamics to biological reactions. In addition, you will define Gibbs free energy, determine the Gibbs free energy change associated with a biochemical reaction, and identify spontaneous and non-spontaneous reactions.\nAt the end of this unit, you will be familiar with the different levels of organization of life, and the differences between eukaryotic and prokaryotic cells. You will understand the structures and properties of the major groups of macromolecules, including lipids and phospholipids, carbohydrates nucleic acids, and proteins, as well as their functions in the cell. You will be familiar with primary, secondary, tertiary, and quaternary levels of protein structure and know what types of bonds and forces stabilize each level. In addition, you will understand the effect of an amino acid substitution on the general structure and function of a protein. You will know how ATP provides the energy to power cellular work.\nFinally, you will have a greater understanding of the reactions in cellular respiration and photosynthesis, when they occur, and why they are important. You will understand the relationships between cellular respiration and photosynthesis.\nLooking for something specific in this course? The Resource Index compiles links to most course resources in a single page.\n« Previous | Next »\n"}


