
{
  "title":"Constructing and Screening a Recombinant DNA Library",
  "content":"« Previous | Next »\nSession Overview This session will review how to make a recombinant genomic DNA library and how to use this library to find a specific gene. This session will outline using a library to clone a gene by complementation of a mutant phenotype.\nLearning Objectives\nTo understand what a recombinant genomic DNA library is and how it is constructed. To identify how to use a genomic library to identify a gene of interest. To understand how to clone the gene of interest by complementation of a mutant phenoptype. To understand the limitations of a genomic library. Session Activities Lecture Video Watch the lecture video excerpt\nConstructing and Screening a Recombinant DNA Library Check Yourself Question 1 Put the following steps in the appropriate order for constructing a genomic library: 1. Ligate the vector and insert DNA together using DNA ligase. 2. Isolate genomic DNA from organism. 3. Transform a population of host cells (E. coli). 4. Cut both the genomic DNA and the chosen vector with the same restriction enzyme(s). 5. Plate the transformed cells onto selective media. a-b-c-d-e close b-a-d-c-e close b-d-a-c-e check c-e-a-b-d close d-a-c-b-e close Check Question 2 You plan to create an E. Coli genomic DNA library and clone a gene for arginine synthesis (the ARG1 gene) by complementation of a mutant phenotype. Which of the following statements is true? 1. You would isolate genomic DNA from a wild type cell. 2. You would isolate genomic DNA from an ARG1- mutant cell. 3. You would transform a population of wild type host cells. 4. You would transform a population of ARG1- mutant cells. 5. You would plate the transformed cells onto media with ampicillin. 6. You would plate the transformed cells onto media without arginine. All of these statements are true close a, d, e close a, d, f check b, c, e close b, c, f close Check Session Activities Help Session Video Watch the short video of Robert Dorkin explaining genomic libraries and cDNA libraries.\nGenomic and cDNA Libraries Practice Problems Problems (PDF) Solutions (PDF) Further Study Useful Links Mapping and Sequencing the Human Genome Construction of a DNA Library Library Generation « Previous | Next »\n"}


