
{
  "title":"Macromolecules: Lipids, Carbohydrates, Nucleic Acid",
  "content":"« Previous | Next »\nSession Overview This session will introduce the general structure and function of the biological macromolecules: lipids, carbohydrates, and nucleic acids.\nLearning Objectives\nTo understand the general structure and properties of lipids and phospholipids and their function in the cell. To understand the general structure and properties of carbohydrates and their function in the cell. To understand the general structure and properties of nucleic acids and their function in the cell. Session Activities Lecture Video Watch the lecture video excerpt\nMacromolecules: Lipids, Carbohydrates, Nucleic Acid, Excerpt 1 Check Yourself Question 1 Which of the following statements is true for phospholipid molecules? 1. The polar end of phospholipids would contain carbon and phosphorous and oxygen. 2. The non-polar end of phospholipids would contain almost exclusively carbon and hydrogen. 3. The polar end of phospholipids would form hydrogen bonds with water. 4. The non-polar end of phospholipids associate with the cytoplasm of the cell. a,b,c check a,b,c, and d close a,c close b,c,d close Check Question 2 Which of the following statements is true for carbohydrate molecules? 1. The general structure can abbreviated as (CH2O)n. 2. A disaccharide can be formed by a condensation reaction between two glucose molecules. 3. Carbohydrates can be used as an energy source for cells. 4. Carbohydrates can be used as a structural molecule. a,b close a,b,c, and d check b,c close c,d close Check Session Activities Lecture Video Watch the lecture video excerpt\nMacromolecules: Lipids, Carbohydrates, Nucleic Acid, Excerpt 2 Check Yourself Question 1 Nucleotides and nucleic acid polymers have a polarity with respect to their structure. Which of the following would be attached to the 5’ carbon of the ribose of the first nucleotide in a polymer? A hydroxyl group close A nitrogenous base close A phosphate group check Another nucleotide close Check Question 2 How do the monomers found in DNA differ from the monomers found in RNA? Choose all that apply. 1. DNA incorporates four different nitrogenous bases, RNA incorporates three different nitrogenous bases. 2. Thymidine is found in DNA but not RNA. 3. There is a 3’ hydroxyl on the RNA monomer, but not on the DNA monomer. 4. There is a 2’ hydroxyl on the RNA monomer, but not on the DNA monomer. a, b close a, c close b, d check c, d close Check Session Activities Help Session Video Watch the short video of Nicole DeNisco explaining phospholipids, phosphate, and nucleic acids, that refers to Question 1 in the practice problems below.\nLipids, Carbohydrates, and Nucleic Acids Practice Problem Practice Problems Problems (PDF) Solutions (PDF) Further Study Useful Links Phospholipids Lipids Chirality Carbohydrates Building Blocks of DNA Chargaff\u0026rsquo;s Ratio « Previous | Next »\n"}


