
{
  "title":"Biochemical Genetics",
  "content":"« Previous | Next »\nSession Overview This session will explain how a collection of mutants with the same phenotype can be used to study a biochemical pathway. In effect, this session outlines how genetics can be used to study biochemistry. It includes a discussion of yeast as a model system. It outlines how to identify mutants with mutations in the same pathway, how to characterize the mutants into complementation groups, and how to use epistasis tests to infer details about a biochemical pathway.\nLearning Objectives\nTo be familiar with the life cycle of yeast. To understand the difference between a genetic screen and a genetic selection. To understand why mutants with mutations in different genes can have the same phenotype. To understand what a test of dominance is and why it is performed. To understand what a test of complementation is and why it is performed. To understand what a test of epistasis is and why it is performed. Session Activities Lecture Video For this session, watch the video lecture called \u0026ldquo;Genetics 3\u0026rdquo; by Prof. Eric Lander recorded in 2004. Then watch the first 7 ½ minutes of the lecture called \u0026ldquo;Human Genetics.\u0026rdquo;\nGenetics 3 Human Genetics Check Yourself Question 1 A mutant haploid yeast cell that cannot grow without added histidine (mutant 1) is crossed to a wild-type haploid yeast cell (can grow without added histidine). The resulting diploid yeast cell CANNOT grow without added histidine. Which of the following statements is correct? The mutant gene is dominant. close The mutant gene is recessive. close The mutant phenotype (cannot grow without added histidine) is dominant. check The mutant phenotype (cannot grow without added histidine) is recessive. close Check \u0026emsp; Show Solution The phenotype seen in the heterozygotic diploid is dominant. Question 2 The phenotypes of two haploid tryptophan auxotrophs (trp1 and trp2) are both found to be recessive. These two mutants are crossed and the resulting diploid CAN grow on minimal media. Which of the following statements is correct? The trp1 and trp2 mutations are in different genes. close The trp1 and trp2 mutations are in the same gene. check The trp1 and trp2 mutations do not complement. close Check Session Activities Help Session Videos First, watch the short video of Genny Gould explaining the concept of Complementation.\nComplementation Next, watch Genny work a Complementation Problem (PDF) using fruit flies as an example.\nComplementation (Part II) Practice Problems Problems (PDF) Solutions (PDF) Further Study Suggested topics for further study in an introductory-level Biology textbook Test of dominance Test of complementation Test of epistasis Useful Links Complementation Test Epistasis: Gene Interaction and Phenotype Effects « Previous | Next »\n"}


