
{
  "title":"Transcription, Translation",
  "content":"« Previous | Next »\nSession Overview This session will explain how the cell uses its DNA instructions to make a RNA message, and the RNA message to make a protein.\nLearning Objectives\nOutline the processes of transcription and translation. List the basic components needed to successfully undergo transcription and translation. Understand the purpose of the cell\u0026rsquo;s performing transcription and translation. Predict RNA and protein sequences from a given gene. Analyze the effects of a DNA mutation on the RNA and protein produced from that DNA. Session Activities Lecture Video Watch the lecture video excerpt\nTranscription and translation, Excerpt 1 Check Yourself // There was an extra comma at the end of multiList array. $( function($){ var quizMulti = { multiList: [ { ques: \u0026ldquo;In what direction is RNA polymerized?\u0026rdquo;, ans: \u0026ldquo;5\u0026rsquo; to 3\u0026rsquo;\u0026rdquo;, ansSel: [\u0026ldquo;3\u0026rsquo; to 5\u0026rsquo;\u0026rdquo;, \u0026ldquo;3 to 5\u0026rdquo;, \u0026ldquo;N to C\u0026rdquo;], ansInfo: \u0026quot;\u0026quot; }] }; var options = { allRandom: false, Random: false, help: \u0026ldquo;\u0026rdquo;, showHTML: false, animationType: 0, showWrongAns: true, title: \u0026ldquo;Concept test 1\u0026rdquo;, }; $(\u0026quot;#quizArea\u0026quot;).jQuizMe(quizMulti, options); });\nSession Activities Lecture Video Watch the lecture video excerpt\nTranscription and translation, Excerpt 2 Check Yourself Question 1 True or False: More than one codon typically encodes each amino acid. False close True check Check Question 2 Where does translation begin, as indicated on the mRNA transcript? promoter close start codon check terminator close transcription start site close Check Question 3 If the following were a complete mRNA, which codon would be recognized as the stop codon? 5' UAAUGCUGACUAGUUAAGCCCGAGCGAA-3' UAA check UAG close UGA close Check Session Activities Help Session Video Watch the short video of Sera Thornton explaining a transcription and translation question that refers to Question 2 in the practice problems below.\nTranscription and Translation Practice Problems Problems (PDF) Solutions (PDF) Further Study Useful Links The Nobel Prize in Physiology or Medicine 1968 Transcription Animation (Basic) Transcription Animation (Advanced) Translation Animation (Basic) Translation Animation (Advanced) Triplet Code Animation « Previous | Next »\n"}


