
{
  "title":"cDNA Libraries and Expression Libraries",
  "content":"« Previous | Next »\nSession Overview This session will review how to make a recombinant cDNA library and how to use this library to find a specific gene. This session will outline the differences between a genomic and a cDNA library, and discuss how to use a cDNA library to clone a gene of interest.\nLearning Objectives\nTo understand what a recombinant cDNA library is and how it is constructed. To understand how to use a cDNA library to identify a gene of interest by the protein made. Session Activities Lecture Video Watch the lecture video excerpt\ncDNA Libraries and Expression Libraries Check Yourself Question 1 A recombinant vector in a yeast genomic library may contain more than one gene. This is not the case with the recombinant vectors in a yeast cDNA library because… different restriction enzymes are used. close every cDNA fragment cloned into each vector carries only one gene. check the host cells cannot be transformed with a vector carrying more than one gene. close the vectors used in making a cDNA library are different. close Check \u0026emsp; Show Solution For a cDNA library, double stranded DNA is made from mRNA. In eukaryotes, each mRNA molecule represents only one gene. Question 2 Unlike a genomic DNA library, particular care must be taken to ensure that the cDNA library represents every gene in the genome. Why is this the case? A cDNA library lacks introns. close Host cells are more likely to reject vectors with cDNA as compared to genomic DNA. close It is harder to clone cDNA fragments as compared to genomic fragments into the vectors. close Some genes are transcribed only in certain cell types or at low levels. check Check \u0026emsp; Show Solution A cDNA library is made from mRNA. A gene that is not actively transcribed in the cells used as a source of mRNA will not produce mRNA, so that gene will not be represented in the library. Question 3 Many cDNA libraries are used as expression libraries. The vector chosen for use in an expression library must have additional DNA sequence that is not required in the vector chosen for use in a genomic DNA library. What is this sequence? a promoter specific for the host organism check a second selectable marker close additional restriction enzyme sites close an origin of replication close Check Session Activities Help Session Video Watch the short video of Robert Dorkin explaining transformation and protein expression.\nTransformation and Protein Expression Practice Problems Problems (PDF) Solutions (PDF) Further Study Useful Links Isolation and use of cDNA clones Techniques of Molecular Biology « Previous | Next »\n"}


