
{
  "title":"Linkage and Recombination, Genetic Maps",
  "content":"« Previous | Next »\nSession Overview This session will explain why inheritance does not always follow Mendel\u0026rsquo;s rules, or the rules predicted for the chromosome theory of inheritance. Because thousands of different genes are found along a single chromosome, and only one of the pair of chromosomes found in the parent is passed to the offspring, Mendel\u0026rsquo;s law of independent assortment cannot apply to all genes. Because homologous chromosomes can exchange DNA, resulting in recombination, alleles of genes found on the same chromosome in the parent are not necessarily inherited together. Thus the pattern of inheritance depends upon the location of the genes studied with respect to one another. Mating experiments can be used to map the relative distance between linked genes.\nLearning Objectives\nTo understand why Mendel\u0026rsquo;s laws of inheritance do not apply to linked genes. To understand the linear arrangement of genes along a chromosome. To understand how meiosis and crossing over results in recombinant gametes. To predict the outcome of genetic crosses involving one, two or three linked genes. To draw a simple genetic map based upon data from test crosses. Session Activities Lecture Video Watch the lecture video\nLinkage and Recombination, Genetic maps Check Yourself Fruit flies can have red eyes or brown eyes. Fruit flies can have long body hairs or short body hairs. You cross a true-breeding female fly (P1) with red eyes and short hairs to a true-breeding male fly (P2) with brown eyes and long hairs. All of the F1 flies have red eyes and long hairs. Assume the E and H loci are linked.\nQuestion 1 Which of the following phenotypes are dominant? Both brown eyes and long hairs close Both red eyes and long hairs check Both red eyes and short hairs close Brown eyes close Long hairs close Red eyes close Short hairs close Check \u0026emsp; Show Solution The F1 flies show the dominant phenotypes, so red eyes are dominant to brown eyes and long hairs are dominant to short hairs. Question 2 Give the genotypes of the gametes produced in the F1 fly that result from a meiotic event where no recombination occurs between the two loci. EH/ Eh/ eH /eh close EH/ eh close Eh/ eH check Check \u0026emsp; Show Solution The F1 fly has the genotype EeHh, because E and h were inherited together from mom, and e and H were inherited together from dad. If no recombination occurs during meiosis in the F1 cell, only two types of gametes will be produced, eH and Eh. Session Activities Practice Problems Problems (PDF) Solutions (PDF) Further Study Suggested topics for further study in an introductory-level Biology textbook Mendel’s laws of inheritance Common genetic terms Genetic crosses Mendelian inheritance Punnett Squares Useful Links Virtual Genetics Lab Animal Cell Meiosis How Cells Divide Dihybrid Crosses and Linked Genes « Previous | Next »\n"}


