
{
  "title":"Agarose Gel Electrophoresis, DNA Sequencing, PCR",
  "content":"« Previous | Next »\nSession Overview This session will outline methods to analyze genes identified through recombinant DNA technologies.\nLearning Objectives\nTo understand what an agarose gel is and how to use agarose gel electrophoresis to analyze DNA molecules. To understand the basic mechanism of DNA sequencing by the dideoxy chain termination method. To know that there is a vast database containing the DNA sequence of the entire genomes for many different organism, and understand why this is useful. To understand the basic mechanism of the polymerase chain reaction (PCR) method of amplifying DNA and know when to use this technique. Session Activities Lecture Video Watch the lecture video excerpt\nAgarose Gel Electrophoresis, DNA Sequencing, PCR, Excerpt 1 Check Yourself Question 1 Select the true statement or statements. Agarose gel electrophoresis separates DNA molecules by size. check When using Agarose gel electrophoresis, DNA molecules move toward the negative electrode. close When using Agarose gel electrophoresis, large DNA molecules move faster through the gel. close Check Question 2 When using chain termination sequencing, the nucleotides added as a chain terminator are… missing the hydroxyl on both the 2’ and 3’carbon check missing the hydroxyl on the 2’ carbon close missing the hydroxyl on the 3’ carbon close Check Session Activities Lecture Video Watch the lecture video excerpt\nAgarose Gel Electrophoresis, DNA Sequencing, PCR, Excerpt 2 Check Yourself Question 1 Which of the following are required for a successful PCR amplification? 1. One or more copies of the DNA to be amplified. 2. all of the normal DNA nucleotides. 3. some dideoxynucleotides 4. Two distinct primers 5. E. coli DNA polymerase 6. DNA polymerase from an organism that lives at high temperature All of these are required close a, b, d, f check a, c, d, e close a, c, d, f close b, c, d, e close Check Session Activities Help Session Video Watch the short video of Robert Dorkin explaining the Polymerase Chain Reaction (PCR) and DNA sequencing.\nPolymerase Chain Reaction (PCR) Practice Problems Problems (PDF) Solutions (PDF) Further Study Useful Links DNA Sequencing Jonathan Weissman: DNA Sequencing Biology Animation Library PCR Virtual Lab « Previous | Next »\n"}


