
{
  "title":"Glycolysis, Respiration, and Fermentation",
  "content":"« Previous | Next »\nSession Overview This session will outline the cellular mechanisms for harvesting energy from glucose and related sugars. It will briefly outline glycolysis as a mechanism to generate ATP and discuss the fate of the pyruvate produced in glycolysis under anaerobic and aerobic conditions.\nLearning Objectives\nTo understand how cells harvest chemical energy by oxidizing glucose to pyruvate. To know the different ways that pyruvuate is catabolized based upon the presence and absence of oxygen. To understand what fermentation is, when it occurs, and why it is important. To understand what the Citric acid cycle is, when it occurs, and why it is important. To understand what Oxidative Phosphorylation is, when it occurs, and why it is important. Session Activities Lecture Video Watch the lecture video excerpt\nGlycolysis, Respiration, and Fermentation Check Yourself Question 1 In the process of glycolysis, one glucose molecule is oxidized to form 2 pyruvates and which of the following? 2 ADP close 2 ATP close 2 NADH close 2 NAD+ close Oxygen close both 2 NADH and 2 ADP close both 2 NADH and 2 ATP check both 2 NAD+ and 2 ATP close Check Question 2 In a yeast cell under anaerobic conditions, the NADH (from glycolysis) donates electrons to __________, which produces _________ additional ATP? ADP, two close Oxygen, two close Phosphorus, two close ethanol, two close none of these options check pyruvate, two close Check \u0026emsp; Show Solution In a yeast cell under anaerobic conditions, NADH donates electrons to pyruvate. Although this reaction does not produce any additional ATP, it regenerates the NAD+ needed for subsequent rounds of glycolysis. Question 3 In a yeast cell under aerobic conditions, pyruvate is oxidized to Acetyl CoA which enters the _________. NADH donates electrons to __________. The total ATP/glucose produced from these processes and glycolysis is __________. Calvin Cycle, a protein of the electron transport chain, ~18 close Calvin Cycle, oxygen, ~18 close Citric acid cycle, ATP synthase, ~32 close Citric acid cycle, a protein of the electron transport chain, ~32 check electron transport chain, oxygen, ~32 close Check Session Activities Practice Problems Problems (PDF) Solutions (PDF) Further Study Useful Links Glycolysis Cellular Respiration How Glycolysis Works \u0026ldquo;Cell Respiration\u0026rdquo; – Cellular Respiration Song The ATP Cycle « Previous | Next »\n"}


