
{
  "title":"Mendel's Laws",
  "content":"« Previous | Next »\nSession Overview This session will cover the background and assumptions that Mendel made regarding the inheritance of particular traits, the hypotheses he developed, the experiments he performed to test the hypotheses, and the conclusions he made. In addition, how offspring acquire genes (and thus traits) from parents by inheriting chromosomes, and how the movement of chromosomes during meiosis is related to Mendel\u0026rsquo;s rules of inheritance will be emphasized.\nLearning Objectives\nTo understand how experimentation resulted in Mendel\u0026rsquo;s laws of inheritance. To accurately use common genetic terms. To predict the outcome of genetic crosses involving one, two or three unlinked genes. To design a genetic cross that can determine whether a trait is dominant or recessive. To design a genetic cross that can determine the genotype of an individual. To understand the relationship of meiosis to Mendelian inheritance and Punnett Squares. Session Activities Lecture Video Watch the lecture video excerpt\nMendel\u0026rsquo;s Laws, Excerpt 1 Check Yourself You are working with the following pea plants:\nPlant 1: Purple flowers Plant 2: Purple flowers Plant 3: White flowers You set up three mating experiments using these plants and obtain the following results:\nRatio of plants with following Phenotype Experiment Purple flowers White flowers #1: P1 with P2 100 0 #2: P1 with P3 100 0 #3: P2 with P3 50 50 Question 1 Which phenotype is dominant? Purple flowers check White flowers close Check \u0026emsp; Show Solution Experiment #2 demonstrates that purple flower color is dominant to white flower color. Question 2 What is the genotype of Plant 1 with respect to flower color? PP 1 check Pp 2 close pp 3 close Check Question 3 What is the genotype of Plant 2 with respect to flower color? PP 1 close Pp 2 check pp 3 close Check Question 4 What is the genotype of Plant 3 with respect to flower color? PP 1 close Pp 2 close pp 3 check Check Session Activities Lecture Video Watch the lecture video excerpt\nMendel\u0026rsquo;s Laws, Excerpt 2 Check Yourself You are studying two true-breeding varieties of plants. Flower size is controlled by the A gene and flower color is controlled by the B gene.\nParent 1: small yellow flowers\nParent 2: large red flowers\nQuestion 1 You cross the two true-breeding parental plants, and find that **all** the F1 progeny have small red flowers. Which of the following phenotypes are dominant? large red close large yellow close small red check small yellow close Check Question 2 You cross the two true-breeding parental plants, and find that **all** the F1 progeny have small red flowers. What is the genotype of Parent 1 with respect to flower color and size? Use A and B for the dominant traits, a and b for the recessive traits. AABB 4 close AAbb 5 check AaBb 8 close aaBB 6 close aabb 7 close Check Question 3 You cross the two true-breeding parental plants, and find that **all** the F1 progeny have small red flowers. What is the genotype of Parent 2 with respect to flower color and size? Use A and B for the dominant traits, a and b for the recessive traits. AABB 4 close AAbb 5 close AaBb 8 close aaBB 6 check aabb 7 close Check Question 4 You cross the two true-breeding parental plants, and find that **all** the F1 progeny have small red flowers. What is the genotype of F1 progeny with respect to flower color and size? Use A and B for the dominant traits, a and b for the recessive traits. AABB 4 close AAbb 5 close AaBb 8 check aaBB 6 close aabb 7 close Check Question 5 You cross an F1 plant with a true breeding plant that has large yellow flowers and obtain 1000 progeny. Assume that the two genes assort independently. The progeny from this cross could show how many different phenotypes? 1 close 2 close 3 close 4 check 5 close 6 close Check Question 6 You cross an F1 plant with a true breeding plant that has large yellow flowers and obtain 1000 progeny. Assume that the two genes assort independently. Of the 1600 progeny plants, approximately how many would be expected to have large yellow flowers? 100 close 1600 close 300 close 400 check 900 close Check Session Activities Practice Problems Problems (PDF) Solutions (PDF) Further Study Study Guides Terms and definitions (PDF) Suggested topics for further study in an introductory-level Biology textbook Mendel\u0026rsquo;s laws of inheritance Common genetic terms Genetic crosses Punnett Squares Meiosis, and its relationship to Mendelian inheritance and Punnett Squares. Useful Links StarGenetics - Mendelian Genetics Virtual Lab « Previous | Next »\n"}


