
{
  "title":"Proteins, Levels of Structure, Non-Covalent Forces",
  "content":"« Previous | Next »\nSession Overview This session will introduce the general composition, structure, and function of proteins. The relationship between structure and function of a protein will be emphasized.\nLearning Objectives\nTo understand the general composition of a protein. To draw a generic amino acid and categorize each of the 20 amino acids appropriately based upon the nature of the side chain. To understand primary, secondary, tertiary, and quaternary levels of protein structure and know what types of bonds and forces stabilize each level. To understand the effect of an amino acid substitution on the general structure and function of a protein. Session Activities Lecture Video Watch the lecture video excerpt\nProteins, Levels of Structure, Non-Covalent Forces, Excerpt 1 Check Yourself Question 1 How many different functional groups are attached to the alpha carbon of an amino acid? 1 close 2 close 3 close 4 check 5 close Check Question 2 A polypeptide chain is polymerized in which direction? 3’ to 5’ close 5’ to 3’ close Amino to carboxyl check Carboxyl to amino close Check Question 3 Which of the following can be described as “a localized region of three dimensional structure that is stabilized by hydrogen bonds formed between the amine of one amino acid and the carboxyl of another amino acid”? primary structure close quaternary structure close secondary structure check tertiary structure close Check Session Activities Lecture Video Watch the lecture video excerpt\nProteins, Levels of Structure, Non-Covalent Forces, Excerpt 2 Check Yourself Structures of the 20 amino acids (PDF)\nQuestion 1 The amino acids leucine, valine, and phenylalanine would best be described as… non-polar check polar and negatively charged close polar and positively charged close polar and uncharged close Check Question 2 The side chain of serine can form a hydrogen bond with the side chain of which of the following amino acids? Choose all that apply. 1. isoleucine 2. alanine 3. threonine 4. asparigine 5. proline a, b, c close a, b, c, d, e close c, d check d, e close Check Session Activities Practice Problems Problems (PDF) Solutions (PDF) Further Study Study Guides Structures of the 20 amino acids (PDF) Useful Links StarBiochem 3-D Protein Viewer Protein folding Primary, Secondary, Tertiary, and Quaternary Structure of Proteins Gecko Locomotion videos « Previous | Next »\n"}


