
{
  "title":"Meet the TAs",
  "content":"« Previous | Next »\nSera Thornton Hi, I\u0026rsquo;m Sera, and I\u0026rsquo;m a graduate student in the Biology department here at MIT. I was a Biology Teaching Assistant (TA) in the Spring of 2011. I think the best part about the introductory biology course at MIT and on OCW is the variety of professors who teach the course - they are all very enthusiastic about sharing their love of biology\u0026rsquo;s basic principles, and they each bring a slightly different perspective to the topics. I hope to lend more clarity to important topics with my video help sessions. Sometimes in class, discussion of a concept can be spread out over several lectures; it\u0026rsquo;s often helpful to my understanding to review that concept in a more condensed format. I hope you find it helpful too!\nSera Thornton did her bachelor\u0026rsquo;s degree in Biochemistry and Molecular Biology at Penn State University. She is now pursuing her Ph.D. in the Boyer Lab at MIT, where her research focuses on epigenetic gene regulation and how it contributes to the ability of Embryonic Stem Cells to differentiate into all of the different cell types in an adult organism. She is also passionate about education of both students and the public, and about the use of graphics in making information more understandable. The MIT Biology department awarded her the Theresa Keng graduate teaching award for her efforts in the undergraduate Genetics course, in Spring 2009.\nGenevieve Gould Hello, my name is Genny and I was a teaching assistant for the 7.012 Introductory Biology course — which focuses on genetic approaches — in the Fall of 2010. This class is great because it covers a breadth of material ranging from basic molecular interactions to genetic patterns of disease inheritance. With the skills taught in this introductory Biology course, you will learn some of the basics you need to start working on a research project in a lab. Throughout the course you will see how the different topics build on each other and understand how the topics are quite practical and even give you a better understanding of news articles about biology today.\nGenevieve Gould grew up in Pacific Palisades, California. Ever since she was young she was interested in math, and in high school she discovered she was also very interested in biology. To further explore her interest in biology, Genevieve performed research at UC Davis during the summer of 2004 studying disease resistance in rice plants in the lab of Dr. Pamela Rondald. Genevieve went on to obtain her B.A. in Molecular and Cell Biology, with an emphasis in Genetics, Genomics, and Development from the University of California, Berkeley in 2009. She graduated with honors for the computational research she performed in the lab of Dr. Michael Eisen studying nucleosome repelling sequences. Today Genevieve is a graduate student in the lab of Dr. Christopher Burge in the Department of Biology at MIT where she is studying the role of the branch point sequence in regulation of splicing. In her free time, Genevieve enjoys sailing, playing soccer, and ice skating.\nNicole De Nisco Hi! My name is Nicole and I am a graduate student in the Biology department. I was a Teaching Assistant for the 7.014 Introductory Biology course — which focuses on ecology and environment— during my second year of graduate school and before that I served as a tutor for all three versions of MIT’s Introductory Biology courses. The class is so fast paced for beginners that I find it important to really slow it down in recitation and get to the \u0026ldquo;how\u0026rdquo; and \u0026ldquo;why\u0026rdquo; of things. Like many MIT courses, this course is geared towards problem-solving, so a clear understanding of the how and why of biological processes is crucial.\nNicole De Nisco grew up in Los Angeles, California and is the first in her family to pursue a Ph.D. in science. Nicole first attended MIT as an undergraduate and graduated with a B.S. in Biology and a minor in Biomedical engineering. She continued on as a graduate student at MIT and is currently working towards her Ph.D. in Biology in the Walker Lab. Her graduate research explores the symbiosis between nitrogen-fixing bacteria and their plant hosts. In addition, Nicole is a Graduate Resident Tutor in the undergraduate dorm, Next House, and a teaching fellow at the Harvard Extension School. When not doing research, mentoring or teaching, she enjoys cooking, traveling and scuba diving.\nRobert Dorkin Hi, my name is Robert and I\u0026rsquo;m a graduate student in the Biology Department at MIT. I was a teaching assistant for the 7.012 Intoductory Biology course, which does an excellent job at introducing biology to new students. The professors successfully manage to cover the essential core information about biology, while still managing to incorporate lectures about some of the new and exciting research currently going on. The course lectures also provide plenty of information about experimental research, covering how key historical experiments were covered, as well as discussing what current methods are used in research today.\nRobert Dorkin is a Massachusetts native, having grown up in Newton, MA. He went to Swarthmore College for his undergraduate degree in Biochemistry. After graduating in 2006 he spent three years working at Anlylam Pharmaceuticals, an RNAi based biotech in Kendall square, before starting his biology PhD in 2009. Currently Robert is a graduate student in Dr. Daniel Anderson\u0026rsquo;s lab in the Koch Institute where he is continuing his research on liposomal based siRNA delivery to liver cells. Robert enjoys napping and world domination.\n« Previous | Next »\n"}


