
{
  "title":"Genetics",
  "content":"« Previous | Next »\nA diagram of a human pedigree chart (image by Michelle Mischke).\nThis unit will cover the background and assumptions that Mendel made regarding the inheritance of particular traits, the hypotheses he developed, the experiments he performed to test the hypotheses, and the conclusions he made. We will explore why inheritance does not always follow Mendel\u0026rsquo;s rules, or the rules predicted for the chromosome theory of inheritance, and how the pattern of inheritance depends upon the location of the genes studied with respect to one another. We will study the inheritance of genes in humans, using pedigree analysis. Finally, we will cover how genetics can be used to study biochemistry, and how a collection of mutants with the same phenotype can be used to study a biochemical pathway.\nDuring this unit, you will be introduced to common genetic terms and learn to use them accurately. You will predict the outcome of genetic crosses involving one, two or three unlinked genes, as well as one, two, or three linked genes. In addition, you will design genetic crosses that can determine the genotype of an individual, and whether a trait is dominant or recessive. You will then draw a simple genetic map based upon data from test crosses. You will also construct a pedigree based on a family history, and analyze the information in the pedigree by applying the laws of inheritance.\nBy the end of this unit, you will understand the relationship of meiosis to Mendelian inheritance and Punnett Squares, and why Mendel\u0026rsquo;s laws of inheritance do not apply to linked genes. You will understand the linear arrangement of genes along a chromosome, and how meiosis and crossing over results in recombinant gametes. You will be able to determine the mode of inheritance of a trait based upon the information in a pedigree, and predict the probability that a child of particular parents would inherit the trait in question.\nFinally, you will become familiar with the life cycle of yeast and understand the difference between a genetic screen and a genetic selection. You will have learned why mutants with mutations in different genes can have the same phenotype. You will understand tests of dominance, complementation, and epistasis, and why they are performed.\nLooking for something specific in this course? The Resource Index compiles links to most course resources in a single page.\n« Previous | Next »\n"}


