
{
  "title":"Biochemical Reactions, Enzymes, and ATP",
  "content":"« Previous | Next »\nSession Overview This session will introduce basic ideas of metabolism, Gibbs free energy, biochemical reactions, enzymes and ATP as the energy currency.\nLearning Objectives\nTo understand that organisms, through their biochemistry, transform matter and energy. To apply the general laws of thermodynamics to biological reactions. To define Gibbs free energy, determine the Gibbs free energy change associated with a biochemical reaction, and identify spontaneous and non-spontaneous reactions. To understand the role that enzymes play in biochemical reactions. To understand how ATP provides the energy to power cellular work. Session Activities Lecture Video Watch the lecture video excerpt\nBiochemical Reactions, Enzymes, and ATP Check Yourself Question 1 If the \u0026#916;G of a reaction is negative, which of the following is a true statement? All of these options. check Energy is released in this reaction. close None of these options. close The reaction is exergonic. close The reaction is spontaneous. close Check Question 2 Choose an ending that makes the following statement true. “In an enzyme catalyzed reaction…” energy is always released close the activation energy is decreased. check the difference in Gibbs free energy between products and reactants is lowered. close the equilibrium constant is changed. close Check Question 3 Which of the following statements is true with respect to ATP? ATP is commonly used in coupled reactions1. The hydrolysis of ATP is an endergonic reaction 2. The hydrolysis of ATP produces inorganic phosphate and ATP. 3. ATP is used as an energy source and a building block in RNA. 4. ATP can donate a phosphate group that becomes covalently linked to a protein. a, b, c, d close a, c, d, e check all of these options close b, c, d close Check Session Activities Practice Problems Problems (PDF) Solutions (PDF) Further Study Useful Links Introduction to Thermodynamics and Protein Folding Enzyme-Catalyzed Reactions ATP and Coupled Reactions « Previous | Next »\n"}


