
{
  "title":"DNA Structure, Classic Experiments",
  "content":"« Previous | Next »\nSession Overview This session will explain early experiments in Molecular Biology. Outlined are classic experiments by Avery, Griffith, Hershey, and Chase that demonstrated DNA was the hereditary material, background on Chargaff, Watson, Crick, and Franklin and how their discoveries contributed to the discovery of the structure of DNA, and details regarding how the semi-conservative model of DNA replication was shown by Meselson and Stahl.\nLearning Objectives\nTo understand the basic outline of the Griffith, Avery, and Hershey/Chase experiments, and how these showed that DNA was the hereditary material. To understand the role Chargaff played in discovering the structure of DNA. To understand the roles Watson, Crick, and Franklin played in discovering the structure of DNA. To understand how the data obtained by Meselson and Stahl confirms the semi-conservative model of DNA replication. To draw a schematic of DNA that highlights the double-stranded nature, the polarity of each strand with respect to the other, and the base pairing between the strands. Session Activities Lecture Video Watch the lecture video excerpt\nDNA Structure and Classic experiments, Excerpt 1 Check Yourself Question 1 Cells can be fractionated into different chemical components. Both Griffith and Avery found cellular fractions that could transform non-disease causing bacteria into disease causing bacteria. In each case, the transforming fraction contained predominantly which of the following molecules? carbohydrates close lipids close nucleic acid check protein close Check \u0026emsp; Show Solution Although the fractions were not completely pure, the fractions that had transforming abilities were greatly enriched for nucleic acid, specifically DNA. Question 2 What functional group is found on the 3’ end of a nucleotide? carboxyl close hydroxyl check nitrogenous base close phosphate close Check Question 3 Which of the following is found in DNA but not in protein? Carbon close Nitrogen close Oxygen close Phosphorus check Sulphur close Check Session Activities Lecture Video Watch the lecture video excerpt\nDNA Structure and Classic experiments, Excerpt 2 Check Yourself Question 1 In density gradient centrifugation, which of the following DNA molecules will travel the farthest down the tube? a 14N-14N duplex close a 14N-15N duplex close a 15N-15N duplex check Check Session Activities Practice Problems Problems (PDF) Solutions (PDF) Further Study Suggested topics for further study in an introductory-level Biology textbook Classic experiments by Avery, Griffith, and Hershey/Chase Chargaff Watson, Crick, and Franklin Semi-conservative model of DNA replication Useful Links Hershey and Chase Experiment Meselson and Stahl Experiment \u0026ldquo;Molecular Structure of Nucleic Acids\u0026rdquo; (The original Watson and Crick paper) « Previous | Next »\n"}


