
{
  "title":"Covalent Bonds, Hydrogen Bonds",
  "content":"« Previous | Next »\nSession Overview This session will introduce the structure of biological molecules and the molecular forces involved in the formation of these molecules.\nLearning Objectives\nTo be able to identify the forces that act in biological systems: covalent bonds, ionic bonds, hydrogen bonds, van der Waal\u0026rsquo;s forces, and hydrophobicity. To understand the properties of covalent bonds as well as the concepts of biological catalysts and chirality. To be able to distinguish between a polar and non-polar molecule and understand the concept of electronegativity. To be able to explain how hydrogen bonds are formed and describe their importance in biological systems. Session Activities Lecture Video Watch the lecture video excerpt\nCovalent Bonds, Hydrogen Bonds Check Yourself Question 1 Which of the following type of bond or interaction joins monomers together to form biological polymers? Covalent Bond check Hydrophobic interactions close Ionic bond close van der Waals forces close Check Question 2 Which of the following does not accurately describe a covalent bond? About 10x as strong as a hydrogen bond. check Can come in the form of a triple bond. close Cannot be broken spontaneously in a biological system. close Shared electrons. close Strongest kind of bond/force in biological molecules. close Check Session Activities Help Session Video Watch the short video of Nicole DeNisco explaining covalent bonds, chirality, electronegativity, and hydrogen bonding, that refers to the practice problem below.\nCovalent Bonds Practice Problems Problems (PDF) Solutions (PDF) Further Study Suggested topics for further study in an introductory-level Biology textbook Forces: covalent bonds, ionic bonds, hydrogen bonds, van der Waal\u0026rsquo;s forces, and hydrophobicity Catalysts Chirality Polarity Useful Links 20-Second Story about Hydrogen Bonding How Geckos Stick Hydrophobic Interactions Green Basilisk Lizard Ice Water and Hot Water movies « Previous | Next »\n"}


